In [1]:
import pandas as pd

In [2]:
import sqlalchemy

In [4]:
!pip install pymysql

Collecting pymysql
  Downloading https://files.pythonhosted.org/packages/1a/ea/dd9c81e2d85efd03cfbf808736dd055bd9ea1a78aea9968888b1055c3263/PyMySQL-0.10.1-py2.py3-none-any.whl (47kB)
Installing collected packages: pymysql
Successfully installed pymysql-0.10.1

In [5]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:@localhost:3306/demo')

In [7]:
df = pd.read_sql_table('customers',engine)

In [8]:
df

     Customer Name Customer Phone
0     rafael nadal     4567895647
1  maria sharapova      434534545
2   vladimir putin       89345345
3      kim un jong      123434456
4       jeff bezos      934534543
5     rahul gandhi       44324222

In [10]:
query ='''

select `Customer Name` from customers where `Customer Name` = 'rafael nadal'
'''

df2 = pd.read_sql_query(query,engine)
df2

  Customer Name
0  rafael nadal

In [11]:
df

     Customer Name Customer Phone
0     rafael nadal     4567895647
1  maria sharapova      434534545
2   vladimir putin       89345345
3      kim un jong      123434456
4       jeff bezos      934534543
5     rahul gandhi       44324222

In [12]:
df.to_sql(
   name='customers2', con=engine,if_exists='append',index=False
)